README.org
#+TITLE: ProjetoEngenharia-Titulo

* Nome do Desafio Tecnológico
** Coloque aqui o nome do desafio tecnológico
** Coloque aqui link para documentos relacionados ao desafio tecnológico (links para detalhes do desafio)

* Nome do Software (ou Biblioteca):
- Coloque aqui o nome do simulador desenvolvido.

* Resumo e/ou informação extra: 
- 

* Versão: 
- 1.0.

* Data:
- 2025/1 - primeiro semestre.
  
* Autor de Contato:
- André Duarte Bueno <andreduartebueno@gmail.com>
- Coloque aqui nome e contato do lider da equipe
  
* Lista dos Autores:
- ...
- André Duarte Bueno <andreduartebueno@gmail.com>

* Áreas de pesquisa vinculadas: 
- Modelagem Matemática Computacional
- ...Engenharia de Reservatório?
- ...Geofísica?
- ...Petrofísica?
- ...Geologia e geoquímica?

* Vinculo com: 
- [[https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado][Trabalho da disciplina Projeto de Software Aplicado à Engenharia]].
- A metodologia utilizada é descrita [[https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas][aqui]].
- Uma lista de outros projetos desenvolvidos no LDSC é disponibilizado [[https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas][aqui]].

* Paradigmas: 
- POO - Programação Orientada a Objeto (códigos em C++)

* Tipo de Interface: 
- Terminal e gráfica (gnuplot).
- Qt? [opcional]

* Plataformas Suportadas: 
- Windows e GNU/Linux e Mac OS X (não testada).

* Linguagens Utilizadas: 
- C++.

* Bibliotecas Utilizadas (dependências):
- CGnuplot - https://github.com/ldsc/CGnuplot
- QCustomPlot - https://www.qcustomplot.com/
- ?
  
* Softwares utilizados (dependências)
- gnuplot http://www.gnuplot.info/

* Tipo de Licença:
- GPL
  
* Novas Versões
- Entre em contato com o Prof. André Duarte Bueno <bueno@lenep.uenf.br>
  para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
- Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
- Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
- Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.
  
* Links:
- [[https://sites.google.com/view/professorandreduartebueno/][Site do Professor André Duarte Bueno]].
- [[https://github.com/ldsc][Site do LDSC no github]].
- [[https://uenf.br/cct/lenep][Site do LENEP]].
  
* Vinculo com: 
- Em alguns casos a versão 1 foi desenvolvida utilizando a metodologia antiga. Nestes casos é necessário copiar os dados da nova versão para a versão antiga. De forma que as próximas versões devem usar a metodologia descrita [[https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas][aqui]].
  Havendo dúvidas consulte o professor.
- [[https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado][Trabalho da disciplina Projeto de Software Aplicado à Engenharia]].
- Uma lista de outros projetos desenvolvidos no LDSC é disponibilizado [[https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas][aqui]].

* Links:
- [[https://sites.google.com/view/professorandreduartebueno/][Site do Professor André Duarte Bueno]].
- [[https://github.com/ldsc][Site do LDSC no github]].
- [[https://uenf.br/cct/lenep][Site do LENEP]].

* Todo
** TODO Você pode colocar aqui atividades a serem desenvolvidas
