README.md

# Table of Contents

1.  [Nome do Desafio Tecnológico](#orga63642c)
    1.  [Coloque aqui o nome do desafio tecnológico](#org2ebec41)
    2.  [Coloque aqui link para documentos relacionados ao desafio tecnológico (links para detalhes do desafio)](#org855260d)
2.  [Nome do Software (ou Biblioteca):](#org8132f6f)
3.  [Resumo e/ou informação extra:](#org72ffa40)
4.  [Versão:](#org10111d4)
5.  [Data:](#orgf581e60)
6.  [Autor de Contato:](#org50824d1)
7.  [Lista dos Autores:](#orgdcfbf20)
8.  [Áreas de pesquisa vinculadas:](#org3e9046d)
9.  [Vinculo com:](#org3a88e7c)
10. [Paradigmas:](#orgbece9a4)
11. [Tipo de Interface:](#orgdcc4e41)
12. [Plataformas Suportadas:](#org5edb591)
13. [Linguagens Utilizadas:](#orgb633128)
14. [Bibliotecas Utilizadas (dependências):](#org22706d5)
15. [Softwares utilizados (dependências)](#orga7939eb)
16. [Tipo de Licença:](#orga5804b1)
17. [Novas Versões](#orgf4e6c94)
18. [Links:](#org3498266)
19. [Vinculo com:](#org7997b0d)
20. [Links:](#org1611c19)
21. [Todo](#org0b6cfa5)
    1.  [Você pode colocar aqui atividades a serem desenvolvidas](#org1c7467e)



<a id="orga63642c"></a>

# Nome do Desafio Tecnológico


<a id="org2ebec41"></a>

## Coloque aqui o nome do desafio tecnológico


<a id="org855260d"></a>

## Coloque aqui link para documentos relacionados ao desafio tecnológico (links para detalhes do desafio)


<a id="org8132f6f"></a>

# Nome do Software (ou Biblioteca):

-   Coloque aqui o nome do simulador desenvolvido.


<a id="org72ffa40"></a>

# Resumo e/ou informação extra:

-   


<a id="org10111d4"></a>

# Versão:

-   1.0.


<a id="orgf581e60"></a>

# Data:

-   2025/1 - primeiro semestre.


<a id="org50824d1"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>
-   Coloque aqui nome e contato do lider da equipe


<a id="orgdcfbf20"></a>

# Lista dos Autores:

-   &#x2026;
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org3e9046d"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   &#x2026;Engenharia de Reservatório?
-   &#x2026;Geofísica?
-   &#x2026;Petrofísica?
-   &#x2026;Geologia e geoquímica?


<a id="org3a88e7c"></a>

# Vinculo com:

-   [Trabalho da disciplina Projeto de Software Aplicado à Engenharia](https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado).
-   A metodologia utilizada é descrita [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).
-   Uma lista de outros projetos desenvolvidos no LDSC é disponibilizado [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).


<a id="orgbece9a4"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgdcc4e41"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).
-   Qt? [opcional]


<a id="org5edb591"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="orgb633128"></a>

# Linguagens Utilizadas:

-   C++.


<a id="org22706d5"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>
-   QCustomPlot - <https://www.qcustomplot.com/>
-   ?


<a id="orga7939eb"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="orga5804b1"></a>

# Tipo de Licença:

-   GPL


<a id="orgf4e6c94"></a>

# Novas Versões

-   Entre em contato com o Prof. André Duarte Bueno <bueno@lenep.uenf.br>
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org3498266"></a>

# Links:

-   [Site do Professor André Duarte Bueno](https://sites.google.com/view/professorandreduartebueno/).
-   [Site do LDSC no github](https://github.com/ldsc).
-   [Site do LENEP](https://uenf.br/cct/lenep).


<a id="org7997b0d"></a>

# Vinculo com:

-   Em alguns casos a versão 1 foi desenvolvida utilizando a metodologia antiga. Nestes casos é necessário copiar os dados da nova versão para a versão antiga. De forma que as próximas versões devem usar a metodologia descrita [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).
    Havendo dúvidas consulte o professor.
-   [Trabalho da disciplina Projeto de Software Aplicado à Engenharia](https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado).
-   Uma lista de outros projetos desenvolvidos no LDSC é disponibilizado [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).


<a id="org1611c19"></a>

# Links:

-   [Site do Professor André Duarte Bueno](https://sites.google.com/view/professorandreduartebueno/).
-   [Site do LDSC no github](https://github.com/ldsc).
-   [Site do LENEP](https://uenf.br/cct/lenep).


<a id="org0b6cfa5"></a>

# Todo


<a id="org1c7467e"></a>

## TODO Você pode colocar aqui atividades a serem desenvolvidas

